## Plan Result (dts_cftptl_intsvc_acme)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_application_insights.appinsight
* Replace
  * azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsight will be updated in-place
  ~ resource "azurerm_application_insights" "appinsight" {
        id                                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-ptl-rg/providers/Microsoft.Insights/components/cft-platform-ptl"
        name                                  = "cft-platform-ptl"
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      - workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
        # (15 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management[0] must be replaced
-/+ resource "azurerm_role_assignment" "app-proxy-ga-service-connection-certificate-management" {
      ~ id                               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-platform-ptl-rg/providers/Microsoft.KeyVault/vaults/acmedtscftptlintsvc/providers/Microsoft.Authorization/roleAssignments/a2215e56-6afd-569f-d353-ba6f99173808" -> (known after apply)
      ~ name                             = "a2215e56-6afd-569f-d353-ba6f99173808" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Authorization/roleDefinitions/a4417e6f-fecd-4de8-b567-7b0420556985" -> (known after apply)
      ~ role_definition_name             = "Key Vault Certificates Officer" -> "Key Vault Secrets User" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":32,"Program":"tfcmt","SHA1":"","Target":"dts_cftptl_intsvc_acme","Vars":{}} -->